In [1]:
import pandas as pd

In [2]:

people = {
    "first" :["Ram","Hari","Shyam","Arav"],
    "last" : ["Thapa","Paudel","Oli","Oli"],
    "email" : ["ramthaapa@gmail.com","haripaudel@gmail.com","shyamoli@gmail.com","a@gmail.com"]
}

In [3]:
df = pd.DataFrame(people)

In [4]:
df

   first    last                 email
0    Ram   Thapa   ramthaapa@gmail.com
1   Hari  Paudel  haripaudel@gmail.com
2  Shyam     Oli    shyamoli@gmail.com
3   Arav     Oli           a@gmail.com

In [5]:
# sorting a single column
df.sort_values(by = 'last') # sortinng a single column named last # this sorts in ascending order

   first    last                 email
2  Shyam     Oli    shyamoli@gmail.com
3   Arav     Oli           a@gmail.com
1   Hari  Paudel  haripaudel@gmail.com
0    Ram   Thapa   ramthaapa@gmail.com

In [6]:
df.sort_values(by = 'last',ascending = False)
# to sort in descending order we have to set an argument ascending to false

   first    last                 email
0    Ram   Thapa   ramthaapa@gmail.com
1   Hari  Paudel  haripaudel@gmail.com
2  Shyam     Oli    shyamoli@gmail.com
3   Arav     Oli           a@gmail.com

In [7]:
# sorting multiple columns

df.sort_values(by = ['first','last'],ascending = False) # sorting the columns named first and last

   first    last                 email
2  Shyam     Oli    shyamoli@gmail.com
0    Ram   Thapa   ramthaapa@gmail.com
1   Hari  Paudel  haripaudel@gmail.com
3   Arav     Oli           a@gmail.com

In [9]:
# sorting multiple columns with different sorting order
df.sort_values(by=['last','first'],ascending=[False,True]) 
# sorts last name coloumn in descending order and first name column in ascending order

   first    last                 email
0    Ram   Thapa   ramthaapa@gmail.com
1   Hari  Paudel  haripaudel@gmail.com
3   Arav     Oli           a@gmail.com
2  Shyam     Oli    shyamoli@gmail.com

In [10]:
# we can set an argument inplace is true to make this sort permanent in the dataframe

df.sort_values(by=['last','first'],ascending=[False,True],inplace= True)

In [11]:
df

   first    last                 email
0    Ram   Thapa   ramthaapa@gmail.com
1   Hari  Paudel  haripaudel@gmail.com
3   Arav     Oli           a@gmail.com
2  Shyam     Oli    shyamoli@gmail.com

In [12]:
df.sort_index()  # this sorts the index

   first    last                 email
0    Ram   Thapa   ramthaapa@gmail.com
1   Hari  Paudel  haripaudel@gmail.com
2  Shyam     Oli    shyamoli@gmail.com
3   Arav     Oli           a@gmail.com

In [13]:
df['last'].sort_values() 
# we can sort a single column like this also

3       Oli
2       Oli
1    Paudel
0     Thapa
Name: last, dtype: object